![title](https://miro.medium.com/max/481/1*cxfqR8NAj8HGal8CVOZ7hg.png)

#  Python Pandas: Tips & Tricks

# #45: Memadukan `loc` Dan `iloc` Untuk Melakukan Seleksi Data

## Import Modules

- Kode di bawah ini untuk memberi tahu berapa versi pandas kalian

In [1]:
import pandas as pd

print(pd.__version__)

1.1.3

## Persiapan Data Frame

In [2]:
df = pd.read_csv('./titanicfull.csv.txt')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

## Memadukan `loc` dan `iloc` untuk melakukan seleksi data

- `iloc` untuk melakukan seleksi data berdasarkan index
- Ruas kiri berkorelasi dengan baris
- Ruas kanan berkorelasi dengan kolom
- Index 20 berperan sebagai batas akhir

In [3]:
df.iloc[15:20, :].loc[:, 'name':'age']

                                               name     sex   age
15                              Baumann, Mr. John D    male   NaN
16                         Baxter, Mr. Quigg Edmond    male  24.0
17  Baxter, Mrs. James (Helene DeLaudeniere Chaput)  female  50.0
18                            Bazzani, Miss. Albina  female  32.0
19                             Beattie, Mr. Thomson    male  36.0

In [4]:
df.loc[:, 'name':'age'].iloc[15:20, :]

                                               name     sex   age
15                              Baumann, Mr. John D    male   NaN
16                         Baxter, Mr. Quigg Edmond    male  24.0
17  Baxter, Mrs. James (Helene DeLaudeniere Chaput)  female  50.0
18                            Bazzani, Miss. Albina  female  32.0
19                             Beattie, Mr. Thomson    male  36.0

# #46: Seleksi Weekdays dan Weekends Pada Data Deret Waktu (Time Series)

## Import Modules

- Kode di bawah ini untuk memberi tahu berapa versi pandas dan numpy kalian

In [5]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

## Persiapan Data Frame

- Nilai integer acak

In [6]:
n_rows = 365
n_cols = 2
cols   = ['col1', 'col2']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns=cols)

df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df

            col1  col2
2000-01-01     3     5
2000-01-02    10     4
2000-01-03    18    14
2000-01-04     8    14
2000-01-05    11     4
...          ...   ...
2000-12-26    10    10
2000-12-27    10     5
2000-12-28     9     1
2000-12-29    17     4
2000-12-30     6     1

[365 rows x 2 columns]

## Seleksi weekdays dan weekends

- Seleksi baris berdasarkan kategori weekdays dan weekends
- `.index.dayofweek` hanya bisa di akses jika data framenya merupakan time series

In [7]:
weekdays_df = df[df.index.dayofweek.isin([0, 1, 2, 3, 4])]
weekdays_df.head(7)

            col1  col2
2000-01-03    18    14
2000-01-04     8    14
2000-01-05    11     4
2000-01-06     5     2
2000-01-07     3     1
2000-01-10    11    19
2000-01-11     4    16

In [8]:
weekends_df = df[df.index.dayofweek.isin([5, 6])]
weekends_df.head(7)

            col1  col2
2000-01-01     3     5
2000-01-02    10     4
2000-01-08    11     5
2000-01-09    19     4
2000-01-15     8    18
2000-01-16     3     8
2000-01-22    10    16

# #47: Deteksi Dan Penanganan Kolom Dengan Tipe Data Beragam (Mixed Data Types)

## Import Modules

- Kode di bawah ini untuk memberi tahu berapa versi pandas kalian

In [13]:
import pandas as pd

print(pd.__version__)

1.1.3

## Persiapan Data Frame

In [16]:
d = {'nama':['bejo', 'tejo', 'wati', 'tiwi', 'cecep'],
     'ipk':[2, '3', 3, 2.75, '3.25']}
df1 = pd.DataFrame(d)
df1

    nama   ipk
0   bejo     2
1   tejo     3
2   wati     3
3   tiwi  2.75
4  cecep  3.25

## Deteksi dan penangan kolom dengan tipe data beragam (mixed data types)

- Mendeteksi keberadaan mixed data types pada data frame dia atas
- Tipe data objek akan berkorelasi dengan tipe data string

In [18]:
df1.dtypes

nama    object
ipk     object
dtype: object

- Mendeteksi keberadaan mixed types pada kolom `ipk`

In [19]:
df1['ipk'].apply(type)

0      <class 'int'>
1      <class 'str'>
2      <class 'int'>
3    <class 'float'>
4      <class 'str'>
Name: ipk, dtype: object

- Membuat ringkasan dari output di atas
- `value_counts()` untuk melakukan perhitungan jumlah dari tiap data type yang berbeda

In [20]:
df1['ipk'].apply(type).value_counts()

<class 'str'>      2
<class 'int'>      2
<class 'float'>    1
Name: ipk, dtype: int64

- Menyeragamkan type data yang berbeda ke tipe data yang sama

In [21]:
df1['ipk'] = df1['ipk'].astype(float)

In [22]:
df1['ipk'].apply(type).value_counts()

<class 'float'>    5
Name: ipk, dtype: int64

# #48: Mengenal Cummulative Count Dengan `cumcount()`

## Import Modules

- Kode di bawah ini untuk memberi tahu berapa versi pandas kalian

In [23]:
import pandas as pd

print(pd.__version__)

1.1.3

## Persiapan Data Frame

In [34]:
d = {'penjual':['bejo', 'tejo', 'wati', 'bejo', 'cecep', 'tejo', 'wati', 'bejo'],
     'barang':['monitor', 'monitor', 'keyboard', 'mouse', 'keyboard', 'monitor', 'laptop', 'monitor']}

Df = pd.DataFrame(d)
Df

  penjual    barang
0    bejo   monitor
1    tejo   monitor
2    wati  keyboard
3    bejo     mouse
4   cecep  keyboard
5    tejo   monitor
6    wati    laptop
7    bejo   monitor

## Mengenal Cummulative Count dengan `cumcount()`

- `sum` adalah penjumlahan nilai sedangkan `count` akan berkorelasi dengan penjumlahan baris atau kemunculan nilai

In [35]:
Df['count_tiap_penjual'] = Df.groupby('penjual').cumcount() + 1
Df

  penjual    barang  count_tiap_penjual
0    bejo   monitor                   1
1    tejo   monitor                   1
2    wati  keyboard                   1
3    bejo     mouse                   2
4   cecep  keyboard                   1
5    tejo   monitor                   2
6    wati    laptop                   2
7    bejo   monitor                   3

- Pengelompokan berdasarkan barang

In [36]:
Df['count_tiap_barang'] = Df.groupby('barang').cumcount() + 1
Df

  penjual    barang  count_tiap_penjual  count_tiap_barang
0    bejo   monitor                   1                  1
1    tejo   monitor                   1                  2
2    wati  keyboard                   1                  1
3    bejo     mouse                   2                  1
4   cecep  keyboard                   1                  2
5    tejo   monitor                   2                  3
6    wati    laptop                   2                  1
7    bejo   monitor                   3                  4

- Pengelompokan berdasarkan kolom penjual dan kolom barang

In [37]:
Df['count_pasangan_kolom'] = Df.groupby(['penjual', 'barang']).cumcount() + 1
Df

,penjual,barang,count_tiap_penjual,count_tiap_barang,count_pasangan_kolom
0,bejo,monitor,1,1,1
1,tejo,monitor,1,2,1
2,wati,keyboard,1,1,1
3,bejo,mouse,2,1,1
4,cecep,keyboard,1,2,1
5,tejo,monitor,2,3,2
6,wati,laptop,2,1,1
7,bejo,monitor,3,4,2